public/ephemeris/2025-06-21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org197c896" class="outline-2">
<h2 id="org197c896">2025-06-21 - The world changes, and so do you</h2>
<div class="outline-text-2" id="text-org197c896">
<p>
I was taking a walk in a park near my room, I often go there when I
want to breathe some fresh air after a long study session or when I
feel anxious. The reason why I go to this specific park is, other than
being easy to reach, the presence of a public book crossing
shelf. There are many of those, scattered across the city, and people
can go there and leave or take any book. If nobody is greedy and
everyone leaves and takes the exact amount, then there would be a
constant number of books always changing. In reality, some people are
more generous than others and overall there is always a good amount of
books, at least 20 in this one. As always, I am curious to see whether
there are new books and if any of them interest me, so I go to the
location. As a side note, I like this place so much that I marked It
and other places in openstreetmap so that their location is registered
for others to use.
</p>

<p>
When I reached the little hose, what I found was a patch of dirt
surrounded by grass. Maybe I was mistaken about the place, so I went
back and forth on the street, but I was not mistaken. Indeed the shelf
was not there anymore, apparently It was decided that It had to be
removed from the park and It's now gone.
</p>

<p>
This reminded me that everything, even good things change. Nothing is
really forever. Obviously this is something I already knew and
experienced, and I accepted It. Likewise, we humans change both as
spices and as individuals in our short lifetime. Previously I was
reading some entries of my diary from three years ago, I noticed that
the things that moved me and the things I did as a consequence of
these were completely different. Yet some things are still the same,
It's always me but the perspective is different and how I perceived
the world is different.
</p>

<p>
When you look back at history you see how so many things change
drastically. We went from horses as a means of transportation to space
rockets in less than a century thanks to human ingenuity. When you
look really back, think about the Roman Empire or civilizations now
lost to time, the changes are so great that It is difficult even to
imagine how the world was at that time. Yet some things are the same,
the mountains that surround my city have been there for
millennial. Once, these mountains were seen as obstacles that you
needed to circumvent to reach other cities. During the first world war
they were seen as a military fortress to protect the border, now they
are seen as nature to protect.
</p>

<p>
I now feel stoic about things changing, I see this as a rule of life
so I don't feel bad when things do change. That works either way for
things that disappear and things that appear. What I can do is to hold
tight what I wish to keep with me longer to delay the inevitable.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
